// ## Configuration
// Dockit relies on a json5 configuration file to tell it how to parse a project

// *project*: Project name
//
// *github*: url and text to display for github repo link
//
// *assets*: an array of filenames in the project to copy to the `__assets` directory to
// be available in the generated documentation, such as the favicon image. Assets copied
// in this way are available at `__assets/asset.ext`
//
// *favicon*: filename to use for favicon. Original image should be an entry in above assets config
//
// *files*: a series of glob matches to indicate which files to parse
// glob matches are specified in separate properites. These namings are arbitrary
// and exist to allow finer control over order by grouping
//
// *ctypes*: an array of comment types to ignore (display as comments in the
// code sections, instead of pulling out and parsing with markdown). Supported comment types:
//
// ```
// HASH: #
// SLASH: //
// DOC_BLOCK: /**
//            *
//            */
// SLASH_STAR: /* */ (multi and singleline)
// BANG: <!-- --> (multi and singleline)
// BRACKET_BANG: {! !} (multi and singleline)
// ```
//
// *ignores*: any comments that should be treated as execptions to the above matching
// based on a simple substring match of the start of a line (singleline only supported)
//
// *all*: boolean whether to generate the all page, generated by default. Otherwise
// the top level project `README` will be used
//
// *index*: remap the index page to another generated html page. By default, with all
// set to true, this will point to the all page.
//
// *allHash*: add an optional hash to the url for the all page (to link to an anchor)
//
{
  "project": "ockit",
  "github" : {
    "url" : "https://github.com/diffsky/dockit",
    "text" : "github"
  },
  "assets" : [ "dockit-assets/dockit.png" ],
  "favicon": "dockit.png",
  "files": {
    "first" : [
      "README.md",
      ".dockit.json5"
    ],
    "second": [
      "**/*.{js,md}",
      "!README.md",
      "!node_modules/**",
      "!docs/**",
      "!templates/**",
      "!assets/**"
    ]
  },
  "ctypes": ["BRACKET_BANG"],
  "ignores": [
    "/* jshint"
  ],
  "allHash" : "#readme_md-s1"
}
